Revit 2027 API
OverrideGraphicSettings.SetProjectionLineColor Method
 Sets the projection surface line color.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public OverrideGraphicSettings SetProjectionLineColor(
	Color color
)
Public Function SetProjectionLineColor (
	color As Color
) As OverrideGraphicSettings
public:
OverrideGraphicSettings^ SetProjectionLineColor(
	Color^ color
)
member SetProjectionLineColor :
        color : Color -> OverrideGraphicSettings
Parameters
color Color
 Value of the projection surface line color for the override. InvalidColorValue means no override is set.
Return Value
OverrideGraphicSettings
 Reference to the changed object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace